In [ ]:
import sqlite3

In [ ]:
# Connect to a SQLite Database
connection = sqlite3.connect('example.db')
connection

In [ ]:
# membuat cursor biar kita bisa melakukan iterasi ke semua baris table
cursor = connection.cursor()

In [ ]:
# membuat table
cursor.execute('''
Create Table If Not Exists employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department Text
    )
''')

# Commit the changes
connection.commit()

In [ ]:
# Lihat struktur tabel employ
cursor.execute("PRAGMA table_info(employees)")
for row in cursor.fetchall():
    print(row)

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'name', 'TEXT', 1, None, 0)
(2, 'age', 'INTEGER', 0, None, 0)
(3, 'department', 'TEXT', 0, None, 0)

In [ ]:
# kalau mau nampilin isi data yang di insert dalam bentuk tabel
import pandas as pd

# Ambil struktur tabel
cursor.execute("PRAGMA table_info(employees)")
columns = ["cid", "name", "type", "notnull", "dflt_value", "pk"]
df = pd.DataFrame(cursor.fetchall(), columns=columns)

df

   cid        name     type  notnull dflt_value  pk
0    0          id  INTEGER        0       None   1
1    1        name     TEXT        1       None   0
2    2         age  INTEGER        0       None   0
3    3  department     TEXT        0       None   0

In [ ]:
cursor.execute('''
Select * from employees
''')

In [ ]:
# Insert data di dalam sqlite table
cursor.execute('''
    Insert Into employees(name, age, department) 
               values ('Vanya', 23, 'Software Engineer Instructor' )
''')

cursor.execute('''
    Insert Into employees(name, age, department) 
               values ('Dani', 22, 'Data Scientist' )
''')

cursor.execute('''
    Insert Into employees(name, age, department) 
               values ('Bayan', 18, 'Data Engineering' )
''')

# Commit Changes
connection.commit()

In [ ]:
# Query the data from the table
cursor.execute('Select * from employees')
rows= cursor.fetchall()

# Print the queried data 
for row in rows:
    print(row)

(1, 'Vanya', 28, 'Software Engineer Instructor')
(2, 'Dani', 22, 'Data Scientist')

In [ ]:
# Update data in the table
cursor.execute('''
    Update employees
               Set age = 28
               Where name = "Vanya"
''')

connection.commit()

In [ ]:
# Delete the data from the table 
cursor.execute('''
    Delete from employees
               Where name = "Bayan"

''')

connection.commit()

---

### Sales data

In [ ]:
# Menggunakan sqlite sales data
connection = sqlite3.connect('sales_data.db')
curs = connection.cursor()

In [ ]:
# Membuat table buat database sales data
curs.execute('''
    CREATE TABLE IF NOT EXISTS sales (
             id INTEGER PRIMARY KEY,
             date TEXT NOT NULL,
             product TEXT NOT NULL,
             sales INTEGER,
             region TEXT
             )
''')

# Insert beberapa data dalam table sales
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

# insert all data 
curs.executemany('''
    INSERT INTO sales(date, product, sales, region)
                 values (?,?,?,?)
''', sales_data)

connection.commit()

In [ ]:
# Query the data from the table
curs.execute('Select * from sales')
rows= curs.fetchall()

# Print the queried data 
for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [ ]:
# Close the connection jadi endak dapet akses database
connection.close()

In [ ]:
# Query the data from the table
curs.execute('Select * from sales')
rows= curs.fetchall()

# Print the queried data 
for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.